Revit 2024 API
InsulationTypeSet.Insert Method
Insert the specified insulation type into the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	InsulationType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As InsulationType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	InsulationType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.InsulationType
The insulation type to be inserted into the set.
Return Value
Returns whether the insulation type was inserted into the set.
See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace